Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 21/Tibco_Output.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Body>
      <ns0:transactionList xmlns:ns0="http://www.hmco.com/EAI/OTS/Transaction">
         <ns0:transaction>
            <ns0:transactionID>0000665816</ns0:transactionID>
            <ns0:type>TRANSACTION_TYPE_STANDARD</ns0:type>
            <ns0:poNumber>3041</ns0:poNumber>
            <ns0:status>TRANSACTION_STATUS_COMPLETELY_PROCESSED</ns0:status>
            <ns0:creationDate>2007-03-05</ns0:creationDate>
            <ns0:orderSource>ORDER_SOURCE_FAX</ns0:orderSource>
            <ns0:division>DIVISION_GREAT_SOURCE</ns0:division>
            <ns0:salesOffice/>
            <ns0:customerEmail>INFO@DONJOHNSTON.CO.UK</ns0:customerEmail>
            <ns0:soldToCustomerID>0000100021</ns0:soldToCustomerID>
            <ns0:soldToSANNumber/>
            <ns0:soldToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns0:soldToCustomerName>
            <ns0:soldToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine1>
               <ns1:addressLine2 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine2>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WARRINGTON</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WT</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer"/>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">GB</ns1:countryCode>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>INFO@DONJOHNSTON.CO.UK</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>Andy@inclusive.co.uk</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
            </ns0:soldToCustomerAddress>
            <ns0:soldToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns0:soldToCustomerEmailAddress>
            <ns0:shipToCustomerID>0000100021</ns0:shipToCustomerID>
            <ns0:shipToSANNumber/>
            <ns0:shipToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns0:shipToCustomerName>
            <ns0:shipToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine1>
               <ns1:addressLine2 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine2>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WARRINGTON</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WT</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer"/>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">GB</ns1:countryCode>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>INFO@DONJOHNSTON.CO.UK</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>Andy@inclusive.co.uk</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
            </ns0:shipToCustomerAddress>
            <ns0:shipToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns0:shipToCustomerEmailAddress>
            <ns0:billToCustomerID>0000100021</ns0:billToCustomerID>
            <ns0:billToSANNumber/>
            <ns0:billToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns0:billToCustomerName>
            <ns0:billToCustomerAddress>
               <ns1:addressLine1 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine1>
               <ns1:addressLine2 xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">18/19 CLARENDON COURT</ns1:addressLine2>
               <ns1:city xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WARRINGTON</ns1:city>
               <ns1:state xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">WT</ns1:state>
               <ns1:zipcode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer"/>
               <ns1:countryCode xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">GB</ns1:countryCode>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>INFO@DONJOHNSTON.CO.UK</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
               <ns1:emailAddressStruct xmlns:ns1="http://www.hmco.com/EAI/OTS/Customer">
                  <ns1:emailAddress>Andy@inclusive.co.uk</ns1:emailAddress>
                  <ns1:isPrimary>true</ns1:isPrimary>
               </ns1:emailAddressStruct>
            </ns0:billToCustomerAddress>
            <ns0:billToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns0:billToCustomerEmailAddress>
            <ns0:isHeaderComplete>true</ns0:isHeaderComplete>
            <ns0:transactionRejectionStatus>TRANSACTION_REJECTION_STATUS_NOT_REJECTED</ns0:transactionRejectionStatus>
            <ns0:transactionLineItem>
               <ns0:productInfo>
                  <ns0:lineNo>10</ns0:lineNo>
                  <ns0:materialID>000000000000052682</ns0:materialID>
                  <ns0:isbn>9780669526820</ns0:isbn>
                  <ns0:description>EAROBICS ADOL/ADULT CLINIC</ns0:description>
                  <ns0:couponCode/>
                  <ns0:promotionType/>
                  <ns0:quantity>10</ns0:quantity>
                  <ns0:listPrice>2.99E3</ns0:listPrice>
                  <ns0:netPrice>1.704E3</ns0:netPrice>
                  <ns0:productDivision>DIVISION_RIVERDEEP</ns0:productDivision>
                  <ns0:listDiscount>1.286E3</ns0:listDiscount>
                  <ns0:isEGood>false</ns0:isEGood>
                  <ns0:isSubscription>false</ns0:isSubscription>
               </ns0:productInfo>
               <ns0:lineitemStatus>LINE_ITEM_STATUS_COMPLETELY_PROCESSED</ns0:lineitemStatus>
               <ns0:lineitemRejectionStatus>LINE_ITEM_REJECTION_STATUS_NOT_REJECTED</ns0:lineitemRejectionStatus>
               <ns0:isLineitemComplete>true</ns0:isLineitemComplete>
               <ns0:titleStatus>MATERIAL_STATUS_IN_PRINT</ns0:titleStatus>
               <ns0:requestDate>2007-03-05</ns0:requestDate>
               <ns0:availableDate>2007-03-16</ns0:availableDate>
               <ns0:salesRep>
                  <ns0:repID>0000020072</ns0:repID>
                  <ns0:repName>INACTIVE 55-388</ns0:repName>
                  <ns0:sfaRepID>550000</ns0:sfaRepID>
               </ns0:salesRep>
               <ns0:itemType>ITEM_TYPE_SALE</ns0:itemType>
               <ns0:isKitComponent>false</ns0:isKitComponent>
            </ns0:transactionLineItem>
            <ns0:shipToCareOf_1/>
            <ns0:shipToCareOf_2/>
         </ns0:transaction>
      </ns0:transactionList>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>